experimental/glm52_b300_fixed_seq/results/c2-four-frontier-megamoe-refresh-20260921/runs/c2-w4a4-trtllm-dp-mem80-20260920/8k1k/w4a4-trtllm/tp4_conc4/benchmark.log
+ run_server_client env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920 python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 8192 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 40 --max-concurrency 4 --request-rate inf --ignore-eos --save-result --num-warmups 8 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a4-trtllm-dp-mem80-20260920/8k1k/w4a4-trtllm/tp4_conc4 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
+ [[ -n /tmp/inferencex-server-state.kXTsSV ]]
+ PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920
+ python3 -m infx.bench_serving.server_watch run --state /tmp/inferencex-server-state.kXTsSV -- env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920 python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 8192 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 40 --max-concurrency 4 --request-rate inf --ignore-eos --save-result --num-warmups 8 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a4-trtllm-dp-mem80-20260920/8k1k/w4a4-trtllm/tp4_conc4 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
Namespace(backend='vllm', base_url='http://0.0.0.0:30000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=4, model='nvidia/GLM-5.2-NVFP4', tokenizer='/data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4', best_of=1, use_beam_search=False, num_prompts=40, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/data/home/ziangli/inferencex-glm52-b300/results/c2-w4a4-trtllm-dp-mem80-20260920/8k1k/w4a4-trtllm/tp4_conc4', result_filename='result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='90,99,99.9', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=True, random_num_workers=0, dsv4=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=8)
Generating 40 prompts using 8 worker processes...
Prompt generation completed in 3.4s
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=6628  max=8180  mean=7354.25  avg_token_mismatch=12.00 
 output_lens: min=820   max=1022  mean=920.12  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 8 requests...
100%|██████████| 8/8 [00:14<00:00,  1.87s/it]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
  0%|          | 0/40 [00:00<?, ?it/s]Starting main benchmark run...
100%|██████████| 40/40 [01:17<00:00,  1.94s/it]
============ Serving Benchmark Result ============
Successful requests:                     40        
Benchmark duration (s):                  77.71     
Total input tokens:                      294170    
Total generated tokens:                  36805     
Request throughput (req/s):              0.51      
Output token throughput (tok/s):         473.60    
Total Token throughput (tok/s):          4258.95   
---------------Time to First Token----------------
Mean TTFT (ms):                          738.72    
Median TTFT (ms):                        462.95    
P90 TTFT (ms):                           1655.70   
P99 TTFT (ms):                           2090.43   
P99.9 TTFT (ms):                         2206.59   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          7.42      
Median TPOT (ms):                        7.22      
P90 TPOT (ms):                           8.31      
P99 TPOT (ms):                           9.10      
P99.9 TPOT (ms):                         9.11      
---------------Inter-token Latency----------------
Mean ITL (ms):                           641.79    
Median ITL (ms):                         437.04    
P90 ITL (ms):                            1279.22   
P99 ITL (ms):                            2845.79   
P99.9 ITL (ms):                          4556.90   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          7557.69   
Median E2EL (ms):                        7491.10   
P90 E2EL (ms):                           8731.82   
P99 E2EL (ms):                           9064.25   
P99.9 E2EL (ms):                         9110.01   
==================================================
+ set +x